# Missing Data

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({
    'A': [1, 2,np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1,2,3]
})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() # by default axis = 0, it will drop all rows that contain NaN

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [5]:
df.dropna(axis = 0, thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [6]:
df.dropna(axis = 1, thresh=2) #drop colums that have at least 2 elements that not NaN

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [15]:
df.fillna(value=df['A'].mean(), inplace = True)

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3